Repository: seanpm2001/mt-training-data
Catalog: ppl/ppl_pontoon.tmx
Source language: en_us
Languages: ppl

source: Pages may load faster, but may also behave unexpectedly
ppl: Ne iswat weli mukimiltia uk talul, melka tesu weli tekiti ken taja te tikneki

source: Paste or enter URL
ppl: Shiksalu ush shikishtuka ne URL

source: Performance
ppl: Shiktamachiwa ken tekiti

source: Powered by %1$s
ppl: Metzwikilia %1$s

source: Power up your privacy
ppl: Shikchikawa ne muichtakanemilis

source: Privacy
ppl: Tay nemi ichtaka

source: Privacy Notice
ppl: Tanawatilis ipal ne ichtaka

source: Privacy & Security
ppl: Ichtakachiwalis wan tamanawilis

source: Private browsing session
ppl: Tanamikilis pal tipashalua ichtaka

source: Protections are OFF for this site
ppl: Tajpialis SEWTUK ipal ini sitioj

source: Protections are ON for this site
ppl: Ne tajtapialis TIMAKATIWIT ipal ini sitioj

source: Rather see the full desktop site?%1$s Menu > Request desktop site
ppl: Tiknekiskia tikita muchi ne tajkwilultapech?%1$s Menu > Shiktajtani ne sitioj ipal ne tajkwilultapech

source: Recommended
ppl: Muyeknekituk

source: Reload website
ppl: Ma mukimilti ne sitioj matapan uksenpa

source: Remote debugging via USB/Wi-Fi
ppl: Shitayekchiwa wejka iwan ne USB/Wi-Fi

source: Remove
ppl: Shikishti

source: Remove all websites
ppl: Shikishti muchi ne sitioj ipal ne matapan

source: Remove custom URLs
ppl: Shikishti mu-URLs

source: Remove from Shortcuts
ppl: Shikishti pal ne Atajos

source: Remove search engines
ppl: Shikishti muchi ne tepusyulu tatemua

source: Rename
ppl: Shiktukeyti uksenpa

source: Report Site Issue
ppl: Shina tay te yek tik ne sitioj

source: Request desktop site
ppl: Shikita version tajkwilultapech

source: Restore default search engines
ppl: Shimukwepa ka achtutalijtuk tepusyulu tatemua

source: Return to previous app
ppl: Shimukwepa ne aplicación panutuk

source: Return to your favorite sites in %1$s quickly. Just select \"Add to Home screen\" from the %1$s menu.
ppl: Shimukwepa tik ne sitioj kan mugustuj tipashalua %1$s talul. Semaya shikishpejpena \"Shiktali tik ne Achtu Iswat\" itech ne menú %1$s.

source: Safe Browsing
ppl: Pal tinejmachnemi keman tipashalua

source: Save
ppl: Shikana

source: Saved and shared images <b>will not be</b> deleted when you erase %1$s history
ppl: Ne kwikwil tikanki wan tiktakulij <b>tesu yawit</b> mupupuat keman tikpupua %1$s tay tiktemuj yewa

source: Search
ppl: Shiktemu

source: Search engine
ppl: Tepusyulu tatemua

source: Search engine name
ppl: Shiktemu ne itukay ne tepusyulu tatemua

source: Search for %1$s
ppl: Shiktemu %1$s

source: Search in Focus
ppl: Shiktemu tik Focus

source: Search in Focus Beta
ppl: Shiktemu tik Focus Beta

source: Search in Focus Nightly
ppl: Shiktemu tik Focus Nightly

source: Searching for something different? Choose another default search engine in Settings.
ppl: Tiktemua seuk? Shikajshiti ukse achtutalijtuk tepusyulu tatemua.

source: Search in Klar
ppl: Shiktemu tik Klar

source: Search or enter address
ppl: Shiktemu u shiktajkwilu ne dirección

source: Search Privately
ppl: Shitatejtemu ichtaka

source: Search string to use
ppl: Ne tajtaketzalis yawit mutemuat

source: Search widget
ppl: Widget tatemua

source: Secure connection
ppl: Muchi yek keman nikneki nimusalua

source: Secure Connection
ppl: Timusalua wan tinejmachnemi

source: Security
ppl: Tetajpialis

source: See fewer banners by automatically rejecting cookie requests, when possible.
ppl: Shikita chupi bajbaners kwak mutawelkwepilia isel ne itajtanilis ne cookie, su weli.

source: Select your preferred engine:
ppl: Shikishpejpena mutepusyulu mugustuj

source: Send crash report to Mozilla
ppl: Shikilwi Mozilla ka mukunakak

source: Send usage data
ppl: Shiktitani ne datuj ipanpa keski seujti nipashalua

source: Server not found
ppl: Ne servidor te muajsik

source: Set %1$s as your default browser and get the benefits of private browsing when you open webpages from other apps.
ppl: Shikajshiti %1$s ken tajtachialis mupal wan tikitas ka tiweliskia tipashalua ichtaka kwak tiktapua ijiswat tik ujukse aplicaciones.

source: Set as default browser
ppl: Shiktali ken ne tajtachialis achtutalijtuk

source: Set by Battery Saver
ppl: Kitalijtuk ika kiana bateríaj

source: Set default, autocomplete
ppl: Shiktali ma senpa nemi achtu, ma temi isel

source: settings
ppl: tachijchiwalis

source: Settings
ppl: Kan titajshitia

source: Share…
ppl: Shiktakuli…

source: Share via
ppl: Shiktakuli tik

source: Shortcut name
ppl: Ne itukey ne ujti kutu

source: Shortcut will open with Enhanced Tracking Protection disabled
ppl: Ne ujti kutu mutapus iwan Enhanced Tracking Protection sewijtuk

source: Shortcut will open with Tracking Protection disabled
ppl: Ne tamelawka tapui kwak sewtuk ne Tamanawilis itech Tapachiwiani

source: Show home screen tips
ppl: Ma nesikan tanajnawatial tik ne achtu iswat

source: Show search suggestions?
ppl: Shikneshti tay niweliskia niktemua

# Site behaving unexpectedly? Try turning off Tracking Protection
source: Site behaving unexpectedly?\n Try turning off Tracking Protection
ppl: Kan titajtachia te tekiti ken tikneki?\n Anka su tiksewia Tamanawalis itech Tapachiwiani

source: Site permissions
ppl: Tay tikajkawa ma muchiwa tik ne sitioj

source: Site Security
ppl: Tetajpialis kan tipashalua

source: Skip
ppl: Te nikneki nikita

source: Some ads track site visits, even if you don’t click the ads
ppl: Sejse tanawatilis kishpelwiat kan tipashalua, melka tesu tikpachua

source: Some search engines cannot show suggestions.
ppl: Sejse tepusyulu tatemuat te welit tanawatiat.

source: Sorry. We’re having a problem with this tab.
ppl: Shitapupulwi. Saman tikpiat uijkayu iwan ini itzun.

source: Start your private browsing session, and we’ll block trackers and other bad stuff as you go.
ppl: Shikpewalti musesión tajtachialis ichtaka, wan tejemet tiu tiktentzakwa ne tapajpachiwiani wan seuk te yejyek kwak tipashalua.

source: Stealth
ppl: Tay ichtaka

source: Stop loading website
ppl: Makaya shikimilti ne sitioj matapan

source: Studies
ppl: Tapepetalis

source: Switch
ppl: Shikpata

source: Switching Apps
ppl: Shikpata ne aplicación

source: Switch to link in new tab immediately
ppl: Shiktapu ne ilpika melaktik tik ukse itzun

source: System default
ppl: Achtutalijtuk sistemaj

source: Tab Crashed
ppl: Ne itzun kunaktuk nemi

source: Tab’s browsing history has been erased.
ppl: Mupupujtuk kan tipashaluj tik ne ijitzun.

source: Tabs open: %1$s
ppl: Itzujtzun tajtapujtuk: %1$s

source: Take private browsing to the next level. Block ads and other content that can track you across sites and bog down page load times.
ppl: Tiweli tipashalua ichtaka te kenha ken ne sejseuk. Shiktentzakwa muchi ne tanawatilis ush muchi tay weliskia metzpachiwia keman tikita ne sitioj wan tay kichiwa yujyulik kan mukimiltiat ne ijiswat.

source: Tap here to trash it all — history, cookies, everything — and start fresh on a new tab.
ppl: Shikpachu nikan pal tikmima muchi — historial, cookies, muchi — wan shipewa uksenpa tik uksé itzun.

source: The application will quit to apply changes
ppl: Ne aplicación mutzakwas pal mupata yek.

source: Theme
ppl: Temaj

source: These default settings offer strong protection. But it’s easy to tweak the settings to meet your specific needs.
ppl: Tiweli tikajshitia ini ken achtutalijtuk pal timutajpia yek. Wan te uij titajshitia pal tichiwa tay timuneki.

source: The site you requested does not support HTTPS
ppl: Ne sitioj taja tiktajtan tesu kiselia HTTPS

source: This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server. <br/><br/> If you’ve connected to this server successfully in the past, the error may be temporary.
ppl: Ini weli mukwepa ne uijkayu iwan ne iconfiguración ne servidor, u anka se akaj kiejekua tashijshikua mukwepa ne servidor. <br/><br/> Asu timusalujtuk yek itech ini servidor ikman, ne tajtakul anka ishtuna chupi.

source: This site doesn’t support HTTPS
ppl: Ini sitioj tesu kiselia HTTPS

source: To allow it:
ppl: Pal tikajkawa:

source: To get search suggestions, %1$s needs to send what you type in the address bar to the search engine you’ve chosen. %2$s.
ppl: Asu tikneki ma timetzilwikan tay tiktemua, %1$s muneki kititania tay titajkwilua tik ne barraj ipal ne dirección ipal ne tepusyulu taishtemua taja tikishpejpen. %2$s.

source: To get suggestions, %1$s needs to send what you type in the address bar to the search engine.
ppl: Pal tikita tanawatilis, %1$s kineki kititania tay tikijkwilua tik ne ibarraj ne dirección tik ne tepusyulu tatemua.

source: Touch the fingerprint sensor to continue.
ppl: Shikchijchimi ne sensor ipal ne mapipiltashkal pal tikalaki.

source: Trackers and Scripts to Block
ppl: Ne tajtapachiwiani wan scripts yawit mutentzakwat

source: Trackers blocked
ppl: Tapachiwiani tentzaktuk

source: Trackers blocked since %s
ppl: Tajtapachiwiani tentzaktiwit an %s

source: Tracking, cookies, data choices
ppl: Kan tikishpejpena ne tapachiwiani, cookies, wan dajdatuj

source: Tracking Protection
ppl: Shikmanawi itech tapachiwiani

source: Trusted site?\n Allowlist disables Tracking Protection for sites you know and trust.
ppl: Tineltuka tik ne iswat?\n Tesu tiwelit timetztajpia itech ne tapachiwiani su tina muchi nemi yek tik ini sitioj.

source: Turning this off may fix some site problems
ppl: Su tiksewia yajini, yaja weli kiekchiwa sejse uijkayu tik ne sitioj

source: Turn off Cookie Banner Reduction for %1$s?
ppl: Shiksewi Cookie Banner Reduction ipal %1$s?

source: Turn off tips on the start screen
ppl: Ma musewi ne tajtanawatial ijpak ne achtu iswat

source: Turn off to fix some sites
ppl: Shiksewi pal tikekchiwa sejse sitioj

source: Turn on Cookie Banner Reduction for %1$s?
ppl: Shiktimaka Cookie Banner Reduction ipal %1$s?

source: Unlock
ppl: Shikchululti

source: Unlock %1$s
ppl: Shikmakishti %1$s

source: Unlock using fingerprint if you’ve added Shortcuts or when a website is already open in %s.
ppl: Shiktapu iwan mumapipiltashkal asu tiktalijtuk Shortcuts u keman se sitioj web tapujtuka tik %s.

source: URL already exists
ppl: URL nemia

source: URL Autocomplete
ppl: URL temi isel

source: URL copied
ppl: URL kupintuk

source: URL to add
ppl: Shiktali ne URL

source: Used to collect, analyze and measure activities like tapping and scrolling
ppl: Mukwi pal mukululua, muishpepeta wan mutamachiwa tay tikchiwa keman titatasa wan titamatilua

source: Use fingerprint to unlock app
ppl: Shiktali ne itashkalchin mumapipil pal tikalaki tik ne aplicación

source: Username
ppl: Mutukay usuarioj

source: Verified by: %1$s
ppl: Kitak yek %1$s

source: Web Content
ppl: Tay nemi ijtik ne Matapan

source: Website loaded
ppl: Ne sitioj matapan mukimiltijtuk

source: We clear your history when you close the app for extra privacy.
ppl: Tejemet tikpupuat tay tikitztuk keman tiktzakwa ne app pal tipashalua ichtaka sejsenpa.

source: Welcome to %1$s
ppl: Yek shiajsi %1$s

source: We’ll leave you to your private browsing, but get a quicker start next time with the %1$s widget on your Home screen.
ppl: Tejemet timetzajkawiliat iwan ne tajtachialis ichtaka wan shipewa talul uksenpa iwan ne widget ipal %1$s tik ne achtu iswat.

source: What’s New
ppl: Tay Yankwik

source: Widget added to home screen
ppl: Ne widget mutalijtuk tik ne achtu iswat

source: Would you like to block cookies?
ppl: Tiknekiskia tiktentzakwa ne cookies?

source: Would you like to turn on search suggestions?
ppl: Tiknekiskia ma timetzmakakan tay tiweliskia tiktemua?

source: Yes
ppl: Eje

source: YES
ppl: EJE

source: Yes please
ppl: Ejé

source: You are not granted any rights or licenses to the trademarks of the Mozilla Foundation or any party, including the Mozilla, Firefox or %1$s names or logos. Additional information may be found <a href="%2$s">here</a>.
ppl: Tesu timetzajkawat tikwi ne tay tupal wan ne lijlicenciaj ipal imajmarcaj wawasujtuk ne Fundación Mozilla ush uksé, nian ne itukay ush ichimal Mozilla, FireFox ush %1$s. Su tikneki tikmatiuk ipanpa, shu <a href="%2$s">nikan</a>.

source: You can leave %1$s to open this link in %2$s.
ppl: Tiweli tikisa tik %1$s pal tiktapua ini ilpika tik %2$s.

source: You can use your fingerprint to continue your current app session.
ppl: Tiweli tikpachua ne ikwikwil mumapipiltashkal pal naka tik ne isesión ne aplicación sanuk.

source: You have disabled Content Blocking for these websites.
ppl: Taja tiksewij Tatentzakwalis ipal Tay Nemi ka Ijtik ipal ne isijsitioj ne Wey Matat.

source: Your autocomplete list:
ppl: Ne mulistaj temi isel:

source: Your browsing history has been erased.
ppl: Mupupujtuk kan tipashaluj yewa.

source: You’re protected!
ppl: Timutajpishtuk!

source: Your fingerprint can unlock %1$s if a URL is already opened in the app. Stealth will be turned on.
ppl: Ne itashkalchin mumapipil weli kimakishtia %1$s su se URL nemia tapujtuk tik ne aplicación. Yawi nemi tik modoj ichtaka.

source: Your Rights
ppl: Tay mupal

source: Your search, your way
ppl: Ken tikneki titatemua

source: As a private browser, we never save and cannot restore your last browsing session.
ppl: Ika se tajtachialis ichtaka, tejemet te keman tikanat tay tikitak yewasan.

source: Authentication required
ppl: Nemi pal tina kaj taja

source: Autocomplete
ppl: Temi isel

source: Autocomplete URLs for sites you use most Long-press any URL in the address bar
ppl: Ma temit isel ne URLs ipal kan taja sejsenpa tipashalua Shikpajpachu ne URL tay tikneki ijtik ne barraj ipal dirección

source: Automatic private browsing. Browse. Erase. Repeat.
ppl: Shipashalu ichtaka ka achtu. Shipashalu. Shitapupu. Shikchiwa uksenpa.

source: Copy image address
ppl: Shikupina ne idirección ne kwikwil

source: Copy link address
ppl: Shikupina ne idirección ne ilpika

source: Custom URLs
ppl: Shikmajmachiwa ne URLs

source: Default URL List
ppl: Listaj achtutalijtuk URL

source: Download
ppl: Shiktemulti

source: Downloaded files <b>will not be deleted</b> when you erase %1$s history.
ppl: Ne archivoj temultijtuk <b>te yawi mupupua </b> kwak tikpupua %1$s tay tikitak yewa.

source: Download File
ppl: Shiktemulti ne archivoj

source: Enable to have %1$s autocomplete over 450 popular URLs in the address bar.
ppl: Shiktimaka pal ma %1$s temi isel tik 450 URLs muishmattuk tik ne barraj direccion.

source: Hide webpages when switching apps
ppl: Shikinaya ijiswat kwak tikpata tekitajtatka

source: Oops
ppl: Ups

source: Open a link in a new tab Long-press any link on a page
ppl: Shiktapu se ilpika tik ukse itzun Shikpajpachu yek ne ilpika taja tikneki tik se iswat

source: Open every link in %1$s Set %1$s as default browser
ppl: Shiktapu sejse ilpika %1$s Shikchiwa %1$s ken ne achtutalijtuk tajtachialis

source: Open link in new tab
ppl: Shiktapu ne ilpika tik ukse itzun

source: Open with app
ppl: Shiktapu iwan ne aplicación

source: Problem loading page
ppl: Se uijkayu panuk keman mukimiltia ne iswat

source: Restart %1$s
ppl: Shiktzinti uksenpa %1$s

source: Return to your favorite sites in %1$s quickly. Just select "Add to Home screen" from the %1$s menu.
ppl: Shimukwepa tik ne sitioj kan mugustuj tipashalua %1$s talul. Semaya shikishpejpena "Shiktali tik ne Achtu Iswat" itech ne menú %1$s.

source: Saved and shared images <b>will not be deleted</b> when you erase %1$s history.
ppl: Ne kwijkwil muantuk wan mutakulijtuk <b>tesu yawi mupuluat</b> keman tikpupua ne tay tikitak yewa %1$s.

source: Save image
ppl: Shikana ne kwikwil

source: Secure connection failed
ppl: Tesu muajsik ne conexión seguruj

source: Share image
ppl: Shiktakuli ne kwikwil

source: Share link
ppl: Shiktakuli ne ilpika

source: Site behaving unexpectedly? Try turning off Tracking Protection
ppl: Kan titajtachia te tekiti ken tikneki? Anka su tiksewia Tamanawalis itech Tapachiwiani

source: Sorry. %1$s had a problem and crashed.
ppl: Shitapupulwia. %1$s kipishki se uijkayu wan kunaktuk tzaktuk.

source: The address isn’t valid
ppl: Ne dirección tesu yek

source: The address wasn’t understood
ppl: Ne dirección tesu mumati

source: The connection timed out
ppl: Tea tinemi salujtuk

source: Trusted site? Allowlist disables Tracking Protection for sites you know and trust.
ppl: Tineltuka tik ne iswat? Tesu tiwelit timetztajpia itech ne tapachiwiani su tina muchi nemi yek tik ini sitioj.

source: Turn off tips on the %1$s start screen
ppl: Shiksewi ne tanawatilis ijtik ne achtu iswat ipal %1$s

source: <ul> <li>Check the address for typing errors such as <strong>ww</strong>.example.com instead of <strong>www</strong>.example.com</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
ppl: <ul> <li>Shikpepeta ne dirección pal tikita su nemi ejerror kenha ken <strong>ww</strong>.example.com ipatka <strong>www</strong>.example.com</li> <li>Su tesu tiweli tikimiltia nian se sitioj, shikpepeta ne titanti ipal mutanutzalis ush su ne Wi-Fi salujtuk nemi.</li> </ul>

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your mobile device’s data or Wi-Fi connection.</li> </ul>
ppl: <ul> <li>Uksan ne sitioj tesu weli tekiti ush kipia wey itekiw. Shikejeku uksenpa nemanha.</li> <li>Asu te weli mukimiltia ne sitioj, shikita ne tijtitanti ipal mutanutzalis ush asu ne Wi-Fi musalujtuk nemi.</li> </ul>

source: <ul> <li>This problem can sometimes be caused by disabling or refusing to accept cookies.</li> </ul>
ppl: <ul> <li>Ini uijkayu anka panu ika seujseujti tesu tikneki tikajkawa tekitit ne cookies.</li> </ul>

source: <ul> <li>Web addresses are usually written like <strong>http://www.example.com/</strong></li> <li>Make sure that you’re using forward slashes (i.e. <strong>/</strong>).</li> </ul>
ppl: <ul> <li> Ne direccion web nesi kenha ken <strong>http://www.example.com/</strong></li> <li> Shiktemu uksenpa asu tikwi tinemi ne barraj ishpilkatuk (i.e.: <strong>/</strong>).</li> </ul>

source: <ul> <li>You might need to install other software to open this address.</li> </ul>
ppl: <ul> <li>Anka ukse programaj muneki ma muajshiti pal tapui ne direccion.</li> </ul>

source: We can’t load this page for some reason.
ppl: Anka se te kiajkawa mukimiltia ini iswat.

source: What's New
ppl: Tay Yankwik

source: How does it work?
ppl: Ken tekiti?

source: Join us
ppl: Shimusentali tuwan

source: Pontoon by Mozilla
ppl: Mozilla kichijki Pontoon

source: Select
ppl: Shikishpejpena

source: Tell Me More
ppl: Shinechilwi ukchiupi

source: That's it!
ppl: Nemika!

source: Translate
ppl: Shikpata

source: Understand context
ppl: Nikneki nikmati ne contextoj

source: What is in-context localization?
ppl: Tay localización tik contextoj?

source: your translation
ppl: ken tikpatak taja

source: account recovery key
ppl: Ne clavej talajsilis pal ne cuentaj

source: add-on
ppl: complementoj

source: All Hands
ppl: Muchi Tumay

source: alternate text
ppl: tajkwilul alternativoj

source: appear
ppl: tachia

source: appearance
ppl: tachishka

source: attack
ppl: tamutilis

source: attacker
ppl: tamutiani

source: Attack Site
ppl: Sitioj tamutilis

source: attendee
ppl: asistentej

source: authenticate
ppl: tatukaymati

source: authenticated
ppl: tatukaymatki

source: authentication code
ppl: Ne códigoj tatukaymati

source: autoplay
ppl: pewa isel

source: backup authentication code
ppl: Ne uksé códigoj tatukaymati pal mupalewia

source: bookmark
ppl: tatilwia

source: boot
ppl: kitakishtilua

source: breakpoint
ppl: selka kan mukeluna

source: Bug report
ppl: Talneshtilis tajtakul

source: certificate authority
ppl: ne tatuktilis tayejkayachiwa

source: channel
ppl: taksalis

source: cipher
ppl: taichtakawia

source: clipboard
ppl: tajkewani

source: colorway
ppl: tanepanulis tajtachishka

source: compact
ppl: kupachijtuk

source: compact - recommend deprioritize
ppl: kikupachua

source: confirmation code
ppl: códigoj ina kia

source: context
ppl: netechkayut

source: cookie banner
ppl: ipanti cookie

source: corrupt
ppl: palantuk

source: corrupted
ppl: mapanaltijtuk

source: crash
ppl: tajtakul

source: cross-site tracking cookie
ppl: cookie tapachiwiani itzalan sijsitioj

source: cryptominer
ppl: cryptomineroj

source: cryptomining
ppl: mineríaj criptotumin

source: debug
ppl: tayekchiwa

source: deceptive site
ppl: sitioj tashijshikuani

source: decode
ppl: tasentaluani

source: decryption
ppl: taichtakapualis

source: disinformation
ppl: tamatilis tashijshikuani

source: distrust
ppl: Tesu yulmati ipanpa

source: enable
ppl: kichiwa ma weli kichiwa se

source: encode
ppl: tasenputzua

source: encrypt
ppl: kichtakawia

source: encryption
ppl: taichtakawilis

source: end user
ppl: takwini ka tipan

source: extension
ppl: tasualis

source: external
ppl: ka kiawak

source: fingerprinter
ppl: ne kichiwa itashkal mapipil

source: fingerprinting
ppl: tachiwalis pal itashkal mapipil

source: Firefox View
ppl: Itachialis Firefox

source: gear
ppl: kwachtatka

source: grassroots
ppl: tzinpewalis

source: home page
ppl: achtu iswat

source: idle
ppl: te ulini

source: import
ppl: takalaktia

source: independent browser
ppl: tajtachialis weli isel

source: innovations
ppl: tayankwikalaktilis

source: insecure
ppl: tesajsay

source: installation
ppl: tatalilis

source: Issue
ppl: Tatitania

source: Legacy extension
ppl: Tasualis muajkwalijtuk

source: misinformation
ppl: Tamatilis te yek

source: native
ppl: nikanchanej

source: net neutrality
ppl: neutralidad matapan

source: nonprofit
ppl: te kineki kichiwa tumin

source: non-profit
ppl: te kineki kichiwa tumin

source: open source
ppl: códigoj tapujtuk

source: override
ppl: tapata

source: pop-up
ppl: tentzin nejnesi

source: preference
ppl: tay tikneki

source: Privacy Policy
ppl: Politicaj ipal ne ichtaka

source: release
ppl: tamimalis

source: report
ppl: kinawatia

source: revert
ppl: kikwepa senpa

source: search suggestion
ppl: tapalewilis pal tatemua

source: security keys
ppl: llavej pal mumanawia

source: sensitive
ppl: sensiblej

source: sidebar
ppl: barraj lateral

source: sign
ppl: kiwawasua firmaj

source: signer
ppl: tawawasuani firmaj

source: sign in
ppl: kitalia itukay

source: sign-in
ppl: kitalia itukay

source: studies
ppl: tapepetalis

source: Terms of Service
ppl: Tejtérminos pal servicioj

source: track
ppl: kitujtuka

source: trackers
ppl: tajtapachiwani

source: Tracking Content
ppl: Tay nemi ijtik ne Tapachiwilis

source: unencrypted
ppl: te inashtuk

source: unresponsive
ppl: te tanankilia

source: unsafe
ppl: tesajsay

source: validate
ppl: kita melawak

source: validity
ppl: melawak

source: version
ppl: versión

source: Web Authentication
ppl: Muita yek ne Matapan

source: Continue with this browser
ppl: Ma ninemi senpa iwan ini tachialuni

source: Copied!
ppl: Muishkupintuk!

source: Copy link
ppl: Shikishkupina ne ilpika

source: Copy the link to open in another browser
ppl: Shikishkupina ne ilpika pal tiktapua tik ukse tachialuni

source: Copy the link to share your file:
ppl: Shikishkupina ne ilpika pal tikmajmaka mutajkwilul:

source: Create a { -firefox } Account or sign in
ppl: Shikchiwa se mutapujka tik { -firefox } ush shiktali mutukay

source: { $days }d { $hours }h { $minutes }m
ppl: { $days } t { $hours } h { $minutes } m

source: Decrypting…
ppl: Tikichtakapuat tinemit…

source: Delete
ppl: Shikpulu

source: Download complete
ppl: Senkiska mutemultij

source: Download files
ppl: Shiktemulti tajkwilul

source: Download { -firefox }
ppl: Shiktemulti { -firefox }

source: Downloading
ppl: Kitemultia nemi

source: Download “{ $name }” with { -send-brand }: simple, safe file sharing
ppl: Shiktemulti “{ $name }” iwan { -send-brand }: ichtaka wan te uij

source: Drag and drop files
ppl: Shiktilana wan shikmayawi ne tajkwilul

source: Encrypting…
ppl: Tikichtakawiat tinemit…

source: Enter your email
ppl: Shiktali mutepusamaw
